Repository: AlirezaBHD/Menu
Catalog: Application/Localization/Resources.*.resx
Languages: fa_ir

# ErrorOccurredInRegisteration
source: an error occurred in registeration
fa_ir: در فرایند ثبت نام خطایی رخ داده است

source: and
fa_ir: و

# AlreadyTaken
source: are already taken
fa_ir: تکراری است

source: email
fa_ir: ایمیل

source: username
fa_ir: نام کاربری

# WrongUsernameOrPassword
source: Username and password combination is wrong
fa_ir: نام کاربری یا رمز عبور اشتباه است

# WrongNumberOfObjects
source: The number of input objects does not match the number of existing objects
fa_ir: تعداد آیتم‌های ورودی با تعداد آیتم‌های موجود یکی نیست.

# InvalidImageFile
source: The image file is not valid
fa_ir: فایل تصویر معتبر نیست.

# RequiredImage
source: An image is required
fa_ir: تصویر الزامی است.

# EmptyImage
source: The image cannot be empty
fa_ir: تصویر نمی‌تواند خالی باشد.

# InvalidImageExtension
source: The image is not valid. Allowed extensions:
fa_ir: تصویر معتبر نیست. پسوندهای مجاز:

# MaxImageSizeExceeded
source: he image size cannot exceed
fa_ir: بیشترین حجم قابل قبول برای عکس

# InvalidImageContent
source: The content of the image file is not valid
fa_ir: محتوای فایل تصویر معتبر نیست.

# NotEmpty
source: must not be empty.
fa_ir: نباید خالی باشد

# Rrequired
source: is required
fa_ir: الزامی است.

# MaxLength
source: The maximum length of
fa_ir: حداکثر طول

source: characters
fa_ir: کاراکتر

# FromTimeNotEqualToTime
source: Start and end times must not be the same.
fa_ir: ساعت شروع و پایان نباید یکسان باشند.

# EmptyToTime
source: End time cannot be empty.
fa_ir: ساعت پایان بازه نمی‌تواند خالی باشد

# RequiredToTime
source: End time is required.
fa_ir: ساعت پایان بازه الزامی است

# FromTimeLessThanToTime
source: Start time must be earlier than end time.
fa_ir: ساعت شروع باید کوچکتر از ساعت پایان باشد.

# InvalidTimeFormat
source: Invalid time format (e.g., 08:30 or 15:45:00).
fa_ir: فرمت زمان نادرست است (مثال: 08:30 یا 15:45:00)

# EmptyFromTime
source: Start time cannot be empty.
fa_ir: ساعت شروع بازه نمی‌تواند خالی باشد

# RequiredFromTime
source: Start time is required.
fa_ir: ساعت شروع بازه الزامی است

# InvalidActivityEnum
source: The entered value for activity status is invalid.
fa_ir: مقدار وارد شده برای وضعیت فعالیت اشتباه است

# RequiredIsActive
source: Active status is required.
fa_ir: وضعیت فعال بودن الزامی است

# RequiredUsername
source: Username is required
fa_ir: نام کاربری الزامی است

# MinLengthUsername
source: Username must be at least 3 characters
fa_ir: نام کاربری باید حداقل ۳ کاراکتر باشد

# MaxLengthUsername
source: Username must not exceed 20 characters
fa_ir: نام کاربری نباید بیش از ۲۰ کاراکتر باشد

# UsernamePattern
source: Username can only contain letters
fa_ir: نام کاربری فقط می‌تواند شامل حروف، عدد و _ باشد

# MinLengthPassword
source: Password must be at least 6 characters
fa_ir: رمز عبور باید حداقل ۶ کاراکتر باشد

# RequiredPassword
source: Password is required
fa_ir: رمز عبور الزامی است

# PasswordUppercase
source: Password must contain at least one uppercase letter
fa_ir: رمز عبور باید حداقل یک حرف بزرگ داشته باشد

# PasswordLowercase
source: Password must contain at least one lowercase letter
fa_ir: رمز عبور باید حداقل یک حرف کوچک داشته باشد

# PasswordNumber
source: Password must contain at least one number
fa_ir: رمز عبور باید حداقل یک رقم داشته باشد

# RequiredEmail
source: Email is required
fa_ir: ایمیل الزامی است

# PasswordSpecial
source: Password must contain at least one special character
fa_ir: رمز عبور باید حداقل یک کاراکتر خاص داشته باشد

# RequiredPhoneNumber
source: Phone number is required
fa_ir: شماره موبایل الزامی است

# InvalidEmail
source: Email is not valid
fa_ir: ایمیل معتبر نیست

# PhoneNumberPattern
source: Phone number must start with 09 and be 11 digits
fa_ir: شماره موبایل باید با 09 شروع شود و 11 رقم باشد

# RequiredActivityPeriod
source: Activity period is required
fa_ir: دوره دسترسی الزامی است

# UnavailableItemType
source: An unavailable item cannot have a type that is available
fa_ir: آیتمی که غیرقابل ارائه است، نمی‌تواند دارای نوعی باشد که در دسترس است.

# InvalidItemTypesCombination
source: An available item must not include types that are all unavailable
fa_ir: آیتم قابل ارائه نباید شامل نوع‌هایی باشد که هیچ‌کدام در دسترس نیستند.

# PriceGreaterThanZero
source: Price must be greater than zero
fa_ir: قیمت باید بیشتر از صفر باشد.

# PriceLessThanOneBillion
source: Price cannot exceed one billion
fa_ir: قیمت نمی‌تواند بیش از یک میلیارد باشد.

# PriceMustBeInteger
source: Price must be an integer
fa_ir: قیمت باید عددی صحیح باشد.

# AllSeatsPositive
source: All seats must be positive numbers greater than zero
fa_ir: تمام جایگاه‌ها باید عددی مثبت و بزرگتر از صفر باشند.

# DuplicateSeatNotAllowed
source: Duplicate seat numbers are not allowed
fa_ir: عدد تکراری به عنوان جایگاه غیرقابل قبول است.

source: not found.
fa_ir: یافت نشد

source: Login Required
fa_ir: نیاز به ورود مجدد است.
